#language: ru

Функционал: Маркет

  Сценарий: Наушники

    Когда Переход на страницу Маркета
    И Переход на страницу Электроника
    И Переход на страницу Наушники и Bluetooth-гарнитуры
    И Переход в Все фильтры
    И устанавливает нижнюю гриницу цены "5000"
    И устанавливает марку "Beats"
    И отображает отобранные товары
    И считает колиечество товаров "21"
    И Запомнить первый элемент в списке
    И Вводит в поисковую строку запомненное значение
    И Нажимает Найти
    И Проверяет наименование найденного товара